src/cf/Enums/ТипыСтруктурныхЕдиниц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыСтруктурныхЕдиниц</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Склад</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Розница</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РозницаСуммовойУчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МагазинГруппаСкладов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подразделение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/CommonModules/ОбменДаннымиУНФКлиентСервер/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

Функция ТипыСтруктурныхЕдиницСкладыИМагазины() Экспорт

	Результат = Новый Массив;
	Результат.Добавить(ПредопределенноеЗначение("Перечисление.ТипыСтруктурныхЕдиниц.МагазинГруппаСкладов"));
	Результат.Добавить(ПредопределенноеЗначение("Перечисление.ТипыСтруктурныхЕдиниц.Склад"));
	Результат.Добавить(ПредопределенноеЗначение("Перечисление.ТипыСтруктурныхЕдиниц.Розница"));
	Результат.Добавить(ПредопределенноеЗначение("Перечисление.ТипыСтруктурныхЕдиниц.РозницаСуммовойУчет"));

	Возврат Результат;

КонецФункции

Функция НовыеПараметрыФормыВыбораДополнительныхУсловий() Экспорт

	Результат = Новый Структура;
	Результат.Вставить("ТаблицаВыбора", "");
	Результат.Вставить("ТаблицаЗаполнения", "");
	Результат.Вставить("КолонкаЗаполнения", "");
	Результат.Вставить("ЗаголовокФормыВыбора", "");
	Результат.Вставить("АдресВыбранныхЗначений", "");
	Результат.Вставить("УпорядочитьПоВозрастаниюИерархии", Ложь);
	Результат.Вставить("Фильтры", Новый Массив);

	Возврат Результат;

КонецФункции

Функция НовыйФильтрФормыВыбораДополнительныхУсловий() Экспорт

	Результат = Новый Структура;
	Результат.Вставить("ИмяПараметра", "");
	Результат.Вставить("ИмяПоля", "");
	Результат.Вставить("ЗначениеПараметра", Новый Массив);

	Возврат Результат;

КонецФункции

#КонецОбласти
